{"config": [{"config": {"return_state": false, "recurrent_dropout": 0.2, "batch_input_shape": [null, 45, 16], "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_constraint": null, "return_sequences": false, "units": 64, "implementation": 1, "unroll": false, "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "dtype": "float32", "stateful": false, "activation": "tanh", "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "unit_forget_bias": true, "dropout": 0.2, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 64, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 9, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential"}