{"keras_version": "2.1.3", "class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 12, 625, 1], "sparse": false, "name": "permute_1_input", "dtype": "float32"}, "name": "permute_1_input", "inbound_nodes": []}, {"class_name": "Permute", "config": {"batch_input_shape": [null, 12, 625, 1], "trainable": false, "dims": [3, 2, 1], "name": "permute_1", "dtype": "float32"}, "name": "permute_1", "inbound_nodes": [[["permute_1_input", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 64, "pointwise_regularizer": null, "pointwise_constraint": null, "depthwise_constraint": null, "padding": "valid", "kernel_size": [1, 5], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "depthwise_regularizer": null, "name": "separable_conv2d_1", "bias_constraint": null, "trainable": false, "strides": [1, 1], "depth_multiplier": 1, "data_format": "channels_last", "bias_regularizer": null}, "name": "separable_conv2d_1", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "gamma_constraint": null, "scale": true}, "name": "batch_normalization_1", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": false, "strides": [1, 3], "data_format": "channels_last", "pool_size": [1, 3]}, "name": "max_pooling2d_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 128, "pointwise_regularizer": null, "pointwise_constraint": null, "depthwise_constraint": null, "padding": "valid", "kernel_size": [1, 3], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "depthwise_regularizer": null, "name": "separable_conv2d_2", "bias_constraint": null, "trainable": false, "strides": [1, 1], "depth_multiplier": 1, "data_format": "channels_last", "bias_regularizer": null}, "name": "separable_conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "gamma_constraint": null, "scale": true}, "name": "batch_normalization_2", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": false, "strides": [1, 2], "data_format": "channels_last", "pool_size": [1, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 256, "pointwise_regularizer": null, "pointwise_constraint": null, "depthwise_constraint": null, "padding": "valid", "kernel_size": [1, 3], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "depthwise_regularizer": null, "name": "separable_conv2d_3", "bias_constraint": null, "trainable": false, "strides": [1, 1], "depth_multiplier": 1, "data_format": "channels_last", "bias_regularizer": null}, "name": "separable_conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "gamma_constraint": null, "scale": true}, "name": "batch_normalization_3", "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": false, "strides": [1, 2], "data_format": "channels_last", "pool_size": [1, 2]}, "name": "max_pooling2d_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"target_shape": [50, 256], "trainable": false, "name": "reshape_1"}, "name": "reshape_1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"go_backwards": false, "units": 256, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "name": "gru_1", "dropout": 0.5, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "trainable": true, "stateful": false, "recurrent_constraint": null, "bias_regularizer": null}}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_1"}, "name": "bidirectional_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"go_backwards": false, "units": 512, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "return_sequences": false, "name": "gru_2", "dropout": 0.5, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "trainable": true, "stateful": false, "recurrent_constraint": null, "bias_regularizer": null}}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_2"}, "name": "bidirectional_2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "relu", "units": 512, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}, "name": "dense_1", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "softmax", "units": 4, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["permute_1_input", 0, 0]]}, "backend": "tensorflow"}