{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Permute", "config": {"trainable": true, "batch_input_shape": [null, 12, 625, 1], "dims": [3, 2, 1], "dtype": "float32", "name": "permute_1"}}, {"class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "trainable": true, "pointwise_regularizer": null, "bias_constraint": null, "name": "separable_conv2d_1", "pointwise_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "depthwise_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "depthwise_regularizer": null, "use_bias": true, "kernel_size": [1, 5], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "center": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 3], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "strides": [1, 3], "padding": "valid"}}, {"class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "trainable": true, "pointwise_regularizer": null, "bias_constraint": null, "name": "separable_conv2d_2", "pointwise_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "depthwise_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "depthwise_regularizer": null, "use_bias": true, "kernel_size": [1, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "center": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "strides": [1, 2], "padding": "valid"}}, {"class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "trainable": true, "pointwise_regularizer": null, "bias_constraint": null, "name": "separable_conv2d_3", "pointwise_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "depthwise_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "depthwise_regularizer": null, "use_bias": true, "kernel_size": [1, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "center": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "strides": [1, 2], "padding": "valid"}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [50, 256], "name": "reshape_1"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "stateful": false, "dropout": 0.5, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "return_state": false, "implementation": 1, "use_bias": true, "recurrent_dropout": 0.2, "recurrent_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "gru_1", "recurrent_activation": "hard_sigmoid", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null}}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "stateful": false, "dropout": 0.5, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "return_state": false, "implementation": 1, "use_bias": true, "recurrent_dropout": 0.2, "recurrent_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "gru_2", "recurrent_activation": "hard_sigmoid", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null}}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 9, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true}}]}